cask_args appdir: '/Applications'

### EXTRA CLI UTILITIES
brew "aria2"                                # CLI downloader with torrent support
brew "dos2unix"                             # Translate newlines between DOS and UNIX
brew "ccat"                                 # Colorized cat
brew "cksfv"                                # Utility to check SFV files
brew "cloc"                                 # Count lines of code
brew "cmus"                                 # Terminal music player
brew "colordiff"                            # Colored diff
brew "ext4fuse"                             # To mount Linux drives
brew "hub"                                  # Perform GitHub actions from the CLI
brew "lastpass-cli", args: ['with-pinentry', 'with-doc'] # Lastpass from terminal
brew "macvim", args: ['with-python3']
brew "mutt", args: ['with-trash-patch']     # Email Client
brew "pass"                                 # UNIX password manager based on gpg
brew "speedtest_cli"                        # Speedtest on CLI
brew "switchaudio-osx"                      # Switch audio input/output
brew "tldr"                                 # Simpler man pages
brew "utimer"                               # CLI timer, countdown and stopwatch


#### NON CORE CASKS ####
cask "adium"                                # IM Client
cask "atom"                                 # Text editor
cask "borgbackup"                           # Incremental and Deduplication backup tool
cask "calibre"                              # Eboook Management
cask "chromium"                             # Open Source web browser
cask "ccleaner"                             # Cache and temporary files removal
cask "coconutbattery"                       # Displays battery health
cask "docker"                               # Containerization tool
cask "filebot"                              # TVshow/Movie renamer
cask "gfxcardstatus"                        # Changes the dedicated and internal graphics
cask "github"                               # Github desktop client (good for diffs)
cask "handbrake"                            # For video transcoding and conversion
cask "hazel"                                # Automate moving files
cask "xquartz"                              # DEP: Inkscape dependency
cask "inkscape"                             # Vector graphics
cask "kodi"                                 # Media center for music, tvshows and movies
cask "lego-digital-designer"                # Lego editing tool
cask "macdown"                              # Simple markdown editor with live preview
cask "mendeley-desktop"                     # Literature manager
cask "musicbrainz-picard"                   # Music tagger
cask "nosleep"                              # Prevents from sleeping with close lid
cask "openemu"                              # Emulator collection
cask "paintbrush"                           # MS paint equivalent
cask "pdftotext"                            # Pdf to text
cask "postman"                              # Debugger for GET/POST requests
cask "pycharm"                              # Use educational license (PAID)
cask "rambox"                               # messaging and emailing app that combines web apps
cask "skype"                                # Video calls
cask "slack"                                # Slack client
cask "sourcetree"                           # Git visualization tool
cask "torbrowser"                           # Anonymized browser
cask "virtualbox"                           # Virtual machines
cask "vagrant"                              # Automated VM management/deployment
cask "vagrant-manager"                      #  helps you manage all your virtual machines in one place directly from the menubar
cask "whatsapp"                             # Whatsapp Desktop Client
cask "xld"                                  # Convert flac files

# PAID Casks
cask "dash"                                 # Offline programming reference (PAID)
cask "kaleidoscope"                         # Visual comparison tool (text, image...)
cask "serial"                               # Serial port console (PAID)
# cask "the-archive-browser"                # Preview compressed files (PAID)
cask "wifi-explorer"                        # Look for wifi networks power and channels (PAID)


### Mac App Store Installs
mas "MPlayerX", id: 421131143                       # Alternative Media player (for conflicts errors mostly)
mas "Who's On My WiFi", id: 909760813               # Easily search devices on wifi and store MAC addresses

### PROGRAMMING LANGUAGES
# Note ruby and python are already on main Brewfile

# C C++
brew "gcc", args: ['with-all-languages']   # Get GCC compiler (macOS default is clang)
brew "gcc@5", args: ['with-all-languages']

# Java and Scala (order matters)
cask "java"
brew "ant"
brew "scala"
brew "sbt"

# Node.js
brew "node"
brew "npm"
brew "nvm"
brew "yarn"

# Haskell
brew "ghc"
brew "cabal-install"

# Go, Julia, R
brew "golang"
cask "julia"
brew "r", args: ['with-openblas']

### EXTRA NICETIES

brew "mono"
cask "sonarr"
cask "radarr"