cask_args appdir: '/Applications'

### EXTRA CLI UTILITIES
brew "aria2"                                # CLI downloader with torrent support
brew "djvu2pdf"                             # Converts djvu files to pdf
brew "dos2unix"                             # Translate newlines between DOS and UNIX
brew "cksfv"                                # Utility to check SFV files
brew "cloc"                                 # Count lines of code
brew "cmus"                                 # Terminal music player
brew "colordiff"                            # Colored diff
brew "ext4fuse"                             # To mount Linux drives
brew "fonttools"                            # Tools to manage fonts
brew "hub"                                  # Perform GitHub actions from the CLI
brew "mutt", args: ['with-trash-patch']     # Email Client
brew "pass"                                 # UNIX password manager based on gpg
brew "speedtest_cli"                        # Speedtest on CLI
brew "switchaudio-osx"                      # Switch audio input/output
brew "timidity"                             # CLI tool for MIDI files
brew "tldr"                                 # Simpler man pages
brew "utimer"                               # CLI timer, countdown and stopwatch


#### NON CORE CASKS ####
cask "borgbackup"                           # Incremental and Deduplication backup tool
cask "brave"								# Adblocker private browser
cask "calibre"                              # Eboook Management
cask "chromium"                             # Open Source web browser
cask "ccleaner"                             # Cache and temporary files removal
cask "coconutbattery"                       # Displays battery health
cask "discord"                              # Discord desktop app
cask "docker"                               # Containerization tool
cask "filebot"                              # TVshow/Movie renamer
cask "gfxcardstatus"                        # Changes the dedicated and internal graphics
cask "github"                               # Github desktop client (good for diffs)
cask "handbrake"                            # For video transcoding and conversion
cask "hazel"                                # Automate moving files
cask "xquartz"                              # DEP: Inkscape dependency
cask "inkscape"                             # Vector graphics
cask "kodi"                                 # Media center for music, tvshows and movies
cask "macdown"                              # Simple markdown editor with live preview
cask "mendeley"                             # Literature manager
cask "musicbrainz-picard"                   # Music Tagger and Renamer
# cask "nosleep"                            # Prevents from sleeping with close lid
cask "openemu"                              # Emulator collection
cask "postman"                              # Debugger for GET/POST requests
cask "pycharm"                              # Use educational license (PAID)
cask "rambox"                               # messaging and emailing app that combines web apps
cask "simple-comic"
cask "skype"                                # Video calls
cask "sourcetree"                           # Git visualization tool
cask "ticktick"                             # Alternative todo app
cask "torbrowser"                           # Anonymized browser
cask "virtualbox"                           # Virtual machines
cask "vagrant"                              # Automated VM management/deployment
cask "vagrant-manager"                      #  helps you manage all your virtual machines in one place directly from the menubar
cask "xld"                                  # Convert flac files

# PAID Casks
cask "dash"                                 # Offline programming reference (PAID)
cask "kaleidoscope"                         # Visual comparison tool (text, image...)
cask "serial"                               # Serial port console (PAID)
cask "wifi-explorer"                        # Look for wifi networks power and channels (PAID)


### Mac App Store Installs
mas "1Password", id: 443987910
mas "Amphetamine", id: 937984704                    # Better up to date Caffeine tool to prevent sleep
mas "LastPass", id: 926036361                       # Password management s
mas "Mathpix Snipping Tool", id: 1349670778         # Capture LaTeX formulas
mas "Microsoft OneNote", id:784801555 	            # Microsoft OneNote
mas "Todoist", id: 585829637                        # Todo list tool
mas "TogglDesktop", id: 957734279                   # Time Tracking app
mas "Tomato One", id: 907364780                     # Pomodoro timers
mas "Who's On My WiFi", id: 909760813               # Easily search devices on wifi and store MAC addresses


### PROGRAMMING LANGUAGES
# Note ruby and python are already on main Brewfile

# C C++
brew "gcc", args: ['with-all-languages']   # Get GCC compiler (macOS default is clang)
# brew "gcc@5", args: ['with-all-languages']

# Java and Scala (order matters)
cask "java"
brew "ant"
brew "scala"
# brew "sbt"

# Node.js
brew "node"
brew "npm"
brew "nvm"
brew "yarn"

# Haskell
brew "ghc"
brew "cabal-install"

# Rust, Go, Julia, R
brew "rust"
brew "golang"
cask "julia"
brew "r", args: ['with-openblas']
brew "lua"

# Docker
brew "docker"                               # Docker Containers
brew "docker-compose"
brew "docker-swarm"

### EXTRA NICETIES


## MPV

### INSTALL MPV  with 60 fps###
# https://www.reddit.com/r/osx/comments/4ljbdq/mpv_tutorial_and_60_fps_playback_on_os_x/
brew "libass", args: ['without-harfbuzz']
brew "ffmpeg", args: ['with-rtmpdump', 'with-openssl', 'with-libass', 'with-libbs2b', 'with-rubberband']
brew "mpv", args: ['with-vapoursynth', 'with-libarchive', 'with-bundle', 'with-bluray-support', 'with-libdvdread', 'with-little-cms2', 'with-lua']
cask "mpv"
brew "mvtools"
brew "ffms2"
brew "subliminal"

# AUTODL
brew "mono"
cask "sonarr"
cask "radarr"