cask_args appdir: '/Applications'



### EXTRA CLI UTILITIES
brew "aria2"                                # Download manager with torrent support
brew "axel"                                 # Fast CLI downloader
brew "cksfv"                                # Utility to check SFV files
brew "cloc"                                 # Count lines of code
brew "cmus"                                 # Terminal music player
brew "colordiff"                            # Colored diff
brew "djvu2pdf"                             # Converts djvu files to pdf
brew "dos2unix"                             # Translate newlines between DOS and UNIX
brew "expect"                               # To write scripts that expect interaction
brew "ext4fuse"                             # To mount Linux drives
brew "fonttools"                            # Tools to manage fonts
brew "fzy"                                  # Another Fuzzy finder
brew "glances"                              # Htop improved
brew "geckodriver"                          # Firefox webdriver
brew "hub"                                  # Perform GitHub actions from the CLI
brew "hugo"                                 # Golang static content generator
brew "languagetool"                         # Spell and Grammar Checker
brew "lftp"                                 # Terminal FTP client
brew "magic-wormhole"                       # CLI tool to share files securely
brew "mutt"                                 # Email Client
brew "nethogs"                              # Network analyzer
brew "pass"                                 # UNIX password manager based on gpg
brew "pv"                                   # Monitor the progress of data through a pipe.
brew "shellcheck"                           # Bash/sh Linter
brew "speedtest_cli"                        # Speedtest on CLI
brew "stress"                               # Creates several types of compute stress
brew "transmission-cli"                     # Tranmission CLI tools
brew "tesseract"                            # OCR tool
brew "tesseract"                            # OCR tool
brew "yamllint"                             # YAML Linter
brew "yq"                                   # Jq for YAML


### WHIMSY
brew "figlet"
brew "toilet"
brew "cmatrix"

#### NON CORE CASKS ####
cask "adobe-acrobat-reader"                 # To fill forms only compatible with Adobe Acrobat
cask "balenaetcher"                               # Tool for flashing USB/SD/&c from .img/.iso
cask "bluejeans"                            # FB internal Videoconference
cask "cscreen"                              # Check Display properties from CLI
cask "docker"                               # Containerization tool
cask "dozer"                                # Menubar hider (FOSS bartender)
cask "iina"                                 # Video player with nicer configs than VLC
cask "marta"                                # Better file manager
# cask "mathpix-snipping-tool"                # Latex OCR
cask "inkscape"                             # Vector graphics
cask "itsycal"                              # Simple and configurable menubar clock
cask "meld"                                 # Diff/Merge tool
cask "monitorcontrol"                       # Uses DDC/CI to setup monitor brightness/contrast
cask "obinskit"                             # Anne Pro 2 configurator
cask "obs"                                  # Screen recording/streaming software
cask "obsidian"                             # Knowledge base
cask "openemu"                              # Emulator collection
cask "plexamp"                              # Music Plex player
cask "rescuetime"                           # Time tracking & productivity
cask "sequel-pro"                           # SQL frontend
cask "simple-comic"                         # Comic viewer
cask "skype"                                # Video calls
cask "soulseek"                             # file sharing
cask "transmission"                         # Torrent client
cask "tunnelblick"                          # OpenVPN client
cask "vagrant"                              # Automated VM management/deployment
cask "vorta"                                # Borg Wrapper, scheduler and menu item
cask "yacreader"                            # Comic reader
cask "zoomus"                               # Zoom.us video conference software
cask "zotero"                               # Bibliography management

# Fonts
# tap 'homebrew/cask-fonts'
brew "svn" # Many fonts require it
cask "font-fontawesome"
cask "font-awesome-terminal-fonts"
cask "font-anonymous-pro"
cask "font-cascadia-mono"
cask "font-cascadia-code"
cask "font-charter"
cask "font-comic-neue"
cask "font-consolas-for-powerline"
cask "font-dejavu"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-droid-sans-mono-for-powerline"
cask "font-fantasque-sans-mono"
cask "font-fira-mono-for-powerline"
cask "font-hack"
cask "font-hasklig"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-inconsolata-g-for-powerline"
cask "font-iosevka"
cask "font-liberation-mono-for-powerline"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
cask "font-monofur-for-powerline"
cask "font-monoid"
cask "font-noto-mono-for-powerline"
cask "font-powerline-symbols"
cask "font-roboto-mono-for-powerline"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-terminus"
cask "font-times-new-roman"
cask "font-ubuntu-mono-derivative-powerline"

tap 'colindean/fonts-nonfree'
cask "font-microsoft-office"


### PROGRAMMING LANGUAGES
# Note ruby and python are already on main Brewfile

# C C++
brew "gcc"  # Get GCC compiler (macOS default is clang)

# Java and Scala (order matters)
brew "java"

# Node.js
brew "node"
brew "npm"
brew "yarn"

# Haskell
brew "stack"

# Go, Julia, R
brew "golang"
cask "julia"
# cask "R"
# cask "rstudio"
brew "lua"
brew "luarocks"

# Latex Tools
brew "tectonic"
brew "texlab"
